Pandas

In [1]:
import pandas as pd

data=pd.Series([ 0.25 , 0.5 , 0.75 , 1.0 ],index=[2,7,5,2])
# print(data.values)
# print(data.index)
# print(data[1])
# print(data[1:3])
print(data[2])
# print(data[0])

2    0.25
2    1.00
dtype: float64

creating dataframe susing dict or List

In [2]:
#Creating DataFrame using DICT OR KIST
lst1=[38332521,423967]
lst2=[29332521,673967]
lst4=[38332533,124967]
pd.DataFrame([lst1,lst2,lst4],index=["california","texas","new york"],columns=['population','area'])

            population    area
california    38332521  423967
texas         29332521  673967
new york      38332533  124967

In [3]:
list1=['Yellow','50']
list2=['Red','25']
list3=['Orange','90']
pd.DataFrame([list1,list2,list3], index=['Mango','Apple','Orange'], columns=['Color','count'])

         Color count
Mango   Yellow    50
Apple      Red    25
Orange  Orange    90

In [4]:
population_dict={"California":32783289,
                 "New York":32783289,
                 "Texas":32783289}

area_dict={"California":2378,
           "New York":2378,
           "Texas":2378}

states=pd.DataFrame({'population': population_dict, 'area': area_dict})
print (states)

            population  area
California    32783289  2378
New York      32783289  2378
Texas         32783289  2378

In [5]:
print("DataFrame Row names \n", states.index)
print("DataFrame Columns Names \n",states.columns)

DataFrame Row names
 Index(['California', 'New York', 'Texas'], dtype='object')
DataFrame Columns Names
 Index(['population', 'area'], dtype='object')

In [6]:
l1=["Xavier","Maxico City", 41,88.0]
l2=["Ann","Toronto", 28,79.0]
l3=["Jana","Prague", 33,81.0]
l4=["Yi","Shanghai", 34,80.0]
l5=["Robin","Manchester", 38,68.0]
l6=["Amal","Cairo", 31,61.0]
l7=["Nori","Osaka", 37,84.0]
data=pd.DataFrame([l1,l2,l3,l4,l5,l6,l7],index=[101,102,103,104,105,106,107],columns=["name","city","age","py-score"])
print(data)
print("\n")
print(data.loc[103])
print("\n")
print(data['city'])
print("\n")
print(data.name)

       name         city  age  py-score
101  Xavier  Maxico City   41      88.0
102     Ann      Toronto   28      79.0
103    Jana       Prague   33      81.0
104      Yi     Shanghai   34      80.0
105   Robin   Manchester   38      68.0
106    Amal        Cairo   31      61.0
107    Nori        Osaka   37      84.0


name          Jana
city        Prague
age             33
py-score      81.0
Name: 103, dtype: object


101    Maxico City
102        Toronto
103         Prague
104       Shanghai
105     Manchester
106          Cairo
107          Osaka
Name: city, dtype: object


101    Xavier
102       Ann
103      Jana
104        Yi
105     Robin
106      Amal
107      Nori
Name: name, dtype: object

Hierarical indexing

In [7]:
hindex=[('california',2000),('california',2010),
       ('New_York',2000),('New_York',2010),
       ('Texas',2000),('Texas',2010)]
population=[33232323,34231233,
            33232323,34231233,
            33232323,34231233,]
pop=pd.DataFrame(population,index=hindex)
pop
# pop[[i for i in pop.index if i[1]==2010]]

                           0
(california, 2000)  33232323
(california, 2010)  34231233
(New_York, 2000)    33232323
(New_York, 2010)    34231233
(Texas, 2000)       33232323
(Texas, 2010)       34231233

In [8]:
# Missing values 
import numpy as np
vals1=np.array([1,none,3,4])
vals1.sum()

NameError: name 'none' is not defined

In [ ]:
vals2=np.array([1,np.nan,3,4])
vals2.dtype
print(vals2.sum(),vals2.min(),vals2.max())

nan nan nan

In [ ]:
import pandas as pd
pdvals2=pd.Series(vals2)
print(pdvals2.isnull())
print(pdvals2.notnull())
print(pdvals2.dropna())
print(pdvals2.fillna(10))
print(pdvals2.fillna(method='ffill'))# forward fill to propagate the previous value
print(pdvals2.fillna(method="bfill"))# backward fill to propagate the next value

0    False
1     True
2    False
3    False
dtype: bool
0     True
1    False
2     True
3     True
dtype: bool
0    1.0
2    3.0
3    4.0
dtype: float64
0     1.0
1    10.0
2     3.0
3     4.0
dtype: float64
0    1.0
1    1.0
2    3.0
3    4.0
dtype: float64
0    1.0
1    3.0
2    3.0
3    4.0
dtype: float64

C:\Users\91939\AppData\Local\Temp\ipykernel_17872\524106717.py:7: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(pdvals2.fillna(method='ffill'))# forward fill to propagate the previous value
C:\Users\91939\AppData\Local\Temp\ipykernel_17872\524106717.py:8: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(pdvals2.fillna(method="bfill"))# backward fill to propagate the next value

Working with excel files .csv files

In [ ]:
#Handling Missing Data
import pandas as pd
missdata=pd.read_csv("C:/Users/91939/Desktop/1st-MCA/python/president_heights1.csv")
print(missdata.head(10))
print(missdata.dropna())
print(missdata.fillna(10))
print(missdata.fillna(method='ffill'))# forward fill to propagate the previous value
print(missdata.fillna(method="bfill"))# backward fill to propagate the next value

   order                    name  height(cm)
0      1       George Washington       189.0
1      2              John Adams       170.0
2      3        Thomas Jefferson       189.0
3      4           James Madison       163.0
4      5            James Monroe         NaN
5      6       John Quincy Adams       171.0
6      7          Andrew Jackson         NaN
7      8        Martin Van Buren       168.0
8      9  William Henry Harrison       173.0
9     10              John Tyler       183.0
    order                    name  height(cm)
0       1       George Washington       189.0
1       2              John Adams       170.0
2       3        Thomas Jefferson       189.0
3       4           James Madison       163.0
5       6       John Quincy Adams       171.0
7       8        Martin Van Buren       168.0
8       9  William Henry Harrison       173.0
9      10              John Tyler       183.0
11     12          Zachary Taylor       173.0
12     13        Millard Fillmore       175.0
13     14         Franklin Pierce       178.0
14     15          James Buchanan       183.0
15     16         Abraham Lincoln       193.0
17     18        Ulysses S. Grant       173.0
18     19     Rutherford B. Hayes       174.0
19     20       James A. Garfield       183.0
20     21       Chester A. Arthur       183.0
21     23       Benjamin Harrison       168.0
22     25        William McKinley       170.0
23     26      Theodore Roosevelt       178.0
24     27     William Howard Taft       182.0
25     28          Woodrow Wilson       180.0
26     29       Warren G. Harding       183.0
27     30         Calvin Coolidge       178.0
28     31          Herbert Hoover       182.0
29     32   Franklin D. Roosevelt       188.0
30     33         Harry S. Truman       175.0
31     34    Dwight D. Eisenhower       179.0
32     35         John F. Kennedy       183.0
33     36       Lyndon B. Johnson       193.0
34     37           Richard Nixon       182.0
35     38             Gerald Ford       183.0
36     39            Jimmy Carter       177.0
37     40           Ronald Reagan       185.0
38     41       George H. W. Bush       188.0
39     42            Bill Clinton       188.0
40     43          George W. Bush       182.0
41     44            Barack Obama       185.0
    order                    name  height(cm)
0       1       George Washington       189.0
1       2              John Adams       170.0
2       3        Thomas Jefferson       189.0
3       4           James Madison       163.0
4       5            James Monroe        10.0
5       6       John Quincy Adams       171.0
6       7          Andrew Jackson        10.0
7       8        Martin Van Buren       168.0
8       9  William Henry Harrison       173.0
9      10              John Tyler       183.0
10     11           James K. Polk        10.0
11     12          Zachary Taylor       173.0
12     13        Millard Fillmore       175.0
13     14         Franklin Pierce       178.0
14     15          James Buchanan       183.0
15     16         Abraham Lincoln       193.0
16     17          Andrew Johnson        10.0
17     18        Ulysses S. Grant       173.0
18     19     Rutherford B. Hayes       174.0
19     20       James A. Garfield       183.0
20     21       Chester A. Arthur       183.0
21     23       Benjamin Harrison       168.0
22     25        William McKinley       170.0
23     26      Theodore Roosevelt       178.0
24     27     William Howard Taft       182.0
25     28          Woodrow Wilson       180.0
26     29       Warren G. Harding       183.0
27     30         Calvin Coolidge       178.0
28     31          Herbert Hoover       182.0
29     32   Franklin D. Roosevelt       188.0
30     33         Harry S. Truman       175.0
31     34    Dwight D. Eisenhower       179.0
32     35         John F. Kennedy       183.0
33     36       Lyndon B. Johnson       193.0
34     37           Richard Nixon       182.0
35     38             Gerald Ford       183.0
36     39            Jimmy Carter       177.0
37     40           Ronald Reagan       185.0
38     41       George H. W. Bush       188.0
39     42            Bill Clinton       188.0
40     43          George W. Bush       182.0
41     44            Barack Obama       185.0
    order                    name  height(cm)
0       1       George Washington       189.0
1       2              John Adams       170.0
2       3        Thomas Jefferson       189.0
3       4           James Madison       163.0
4       5            James Monroe       163.0
5       6       John Quincy Adams       171.0
6       7          Andrew Jackson       171.0
7       8        Martin Van Buren       168.0
8       9  William Henry Harrison       173.0
9      10              John Tyler       183.0
10     11           James K. Polk       183.0
11     12          Zachary Taylor       173.0
12     13        Millard Fillmore       175.0
13     14         Franklin Pierce       178.0
14     15          James Buchanan       183.0
15     16         Abraham Lincoln       193.0
16     17          Andrew Johnson       193.0
17     18        Ulysses S. Grant       173.0
18     19     Rutherford B. Hayes       174.0
19     20       James A. Garfield       183.0
20     21       Chester A. Arthur       183.0
21     23       Benjamin Harrison       168.0
22     25        William McKinley       170.0
23     26      Theodore Roosevelt       178.0
24     27     William Howard Taft       182.0
25     28          Woodrow Wilson       180.0
26     29       Warren G. Harding       183.0
27     30         Calvin Coolidge       178.0
28     31          Herbert Hoover       182.0
29     32   Franklin D. Roosevelt       188.0
30     33         Harry S. Truman       175.0
31     34    Dwight D. Eisenhower       179.0
32     35         John F. Kennedy       183.0
33     36       Lyndon B. Johnson       193.0
34     37           Richard Nixon       182.0
35     38             Gerald Ford       183.0
36     39            Jimmy Carter       177.0
37     40           Ronald Reagan       185.0
38     41       George H. W. Bush       188.0
39     42            Bill Clinton       188.0
40     43          George W. Bush       182.0
41     44            Barack Obama       185.0
    order                    name  height(cm)
0       1       George Washington       189.0
1       2              John Adams       170.0
2       3        Thomas Jefferson       189.0
3       4           James Madison       163.0
4       5            James Monroe       171.0
5       6       John Quincy Adams       171.0
6       7          Andrew Jackson       168.0
7       8        Martin Van Buren       168.0
8       9  William Henry Harrison       173.0
9      10              John Tyler       183.0
10     11           James K. Polk       173.0
11     12          Zachary Taylor       173.0
12     13        Millard Fillmore       175.0
13     14         Franklin Pierce       178.0
14     15          James Buchanan       183.0
15     16         Abraham Lincoln       193.0
16     17          Andrew Johnson       173.0
17     18        Ulysses S. Grant       173.0
18     19     Rutherford B. Hayes       174.0
19     20       James A. Garfield       183.0
20     21       Chester A. Arthur       183.0
21     23       Benjamin Harrison       168.0
22     25        William McKinley       170.0
23     26      Theodore Roosevelt       178.0
24     27     William Howard Taft       182.0
25     28          Woodrow Wilson       180.0
26     29       Warren G. Harding       183.0
27     30         Calvin Coolidge       178.0
28     31          Herbert Hoover       182.0
29     32   Franklin D. Roosevelt       188.0
30     33         Harry S. Truman       175.0
31     34    Dwight D. Eisenhower       179.0
32     35         John F. Kennedy       183.0
33     36       Lyndon B. Johnson       193.0
34     37           Richard Nixon       182.0
35     38             Gerald Ford       183.0
36     39            Jimmy Carter       177.0
37     40           Ronald Reagan       185.0
38     41       George H. W. Bush       188.0
39     42            Bill Clinton       188.0
40     43          George W. Bush       182.0
41     44            Barack Obama       185.0

C:\Users\91939\AppData\Local\Temp\ipykernel_15980\1530414639.py:7: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(missdata.fillna(method='ffill'))# forward fill to propagate the previous value
C:\Users\91939\AppData\Local\Temp\ipykernel_15980\1530414639.py:8: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(missdata.fillna(method="bfill"))# backward fill to propagate the next value

In [ ]:
data=pd.read_csv("C:/Users/91939/Desktop/1st-MCA/python/Q8_MortalityDataset.csv")
# print(data)
# data.info()
data.describe()

              AGE     HEIGHT      WEIGHT        CHOL
count  200.000000  200.00000  200.000000  200.000000
mean    35.715000  172.35000   75.885000  233.600000
std      9.604426    6.77399   10.442076   44.766732
min     18.000000  156.00000   53.000000  107.000000
25%     28.750000  168.00000   68.750000  204.000000
50%     37.000000  172.00000   75.000000  232.000000
75%     42.000000  176.00000   82.000000  259.000000
max     58.000000  191.00000  110.000000  455.000000

In [ ]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   AGE     200 non-null    int64
 1   HEIGHT  200 non-null    int64
 2   WEIGHT  200 non-null    int64
 3   CHOL    200 non-null    int64
 4   SMOKE   200 non-null    object
 5   BLOOD   200 non-null    object
 6   MORT    200 non-null    object
dtypes: int64(4), object(3)
memory usage: 11.1+ KB

In [ ]:
print(data)

     AGE  HEIGHT  WEIGHT  CHOL   SMOKE BLOOD   MORT
0     20     176      77   195  nonsmo     b  alive
1     53     167      56   250  sigare     o   dead
2     44     170      80   304  sigare     a   dead
3     37     173      89   178  nonsmo     o  alive
4     26     170      71   206  sigare     o  alive
..   ...     ...     ...   ...     ...   ...    ...
195   35     174      57   222    pipe     a  alive
196   38     172      91   227  nonsmo     b  alive
197   26     170      60   167  sigare     a  alive
198   39     165      74   259  sigare     o  alive
199   49     178      81   275    pipe     b  alive

[200 rows x 7 columns]

In [ ]:
data.shape # rows and columns

(200, 7)

In [ ]:
morsample=data.sample(n=10) # pick random rows. 
print(morsample)

     AGE  HEIGHT  WEIGHT  CHOL   SMOKE BLOOD   MORT
108   37     174      69   260  sigare     b  alive
166   21     186      90   196  sigare     o  alive
15    37     168      86   307  sigare     o  alive
31    30     179      75   225  sigare     a  alive
49    47     177      81   258    pipe     o  alive
46    48     168      86   230  sigare     b   dead
42    37     173      83   278  sigare     a  alive
136   27     168      58   250  sigare     a  alive
173   31     173      87   215  sigare     a  alive
163   34     175      67   170  nonsmo     a  alive

In [ ]:
morsample.iloc[0] #index location. output is not in dataframe but is in series

AGE           37
HEIGHT       174
WEIGHT        69
CHOL         260
SMOKE     sigare
BLOOD          b
MORT       alive
Name: 108, dtype: object

In [ ]:
morsample.iloc[4:8, 1:3] #rows and columns

     HEIGHT  WEIGHT
49      177      81
46      168      86
42      173      83
136     168      58

In [ ]:
morsample.iloc[[0,1]]

     AGE  HEIGHT  WEIGHT  CHOL   SMOKE BLOOD   MORT
108   37     174      69   260  sigare     b  alive
166   21     186      90   196  sigare     o  alive

In [ ]:
morhindex=morsample.groupby(['BLOOD','MORT','SMOKE']).mean() #used as pivot table in excel. displays average of number of records
morhindex

                      AGE  HEIGHT  WEIGHT   CHOL
BLOOD MORT  SMOKE
a     alive nonsmo  34.00  175.00   67.00  170.0
            sigare  31.25  173.25   75.75  242.0
b     alive sigare  37.00  174.00   69.00  260.0
      dead  sigare  48.00  168.00   86.00  230.0
o     alive pipe    47.00  177.00   81.00  258.0
            sigare  29.00  177.00   88.00  251.5

In [ ]:
morhindex1=morsample.groupby(['BLOOD','MORT','SMOKE']).size() #number of records present according to the group
morhindex1

BLOOD  MORT   SMOKE
a      alive  nonsmo    1
              sigare    4
b      alive  sigare    1
       dead   sigare    1
o      alive  pipe      1
              sigare    2
dtype: int64